{
    "_name_or_path": "florence2",
    "architectures": [
        "Florence2ForConditionalGeneration"
    ],
    "auto_map": {
        "AutoConfig": "configuration_florence2.Florence2Config",
        "AutoModelForCausalLM": "modeling_florence2.Florence2ForConditionalGeneration"
    },
    "bos_token_id": 2,
    "decoder_start_token_id": 1,
    "encoder_vocab_size": 51289,
    "eos_token_id": 1,
    "forced_bos_token_id": 2,
    "forced_eos_token_id": 1,
    "ignore_index": -100,
    "model_type": "florence2",
    "pad_token_id": 0,
    "tie_word_embeddings": true,
    "is_encoder_decoder": true,
    "projection_dim": 1024,
    "text_config": {
        "_attn_implementation_autoset": false,
        "_attn_implementation": "eager",
        "_name_or_path": "",
        "activation_dropout": 0.1,
        "activation_function": "gelu",
        "add_bias_logits": false,
        "add_cross_attention": false,
        "add_final_layer_norm": false,
        "architectures": null,
        "attention_dropout": 0.1,
        "bad_words_ids": null,
        "begin_suppress_tokens": null,
        "bos_token_id": 2,
        "chunk_size_feed_forward": 0,
        "classif_dropout": 0.1,
        "classifier_dropout": 0.0,
        "cross_attention_hidden_size": null,
        "d_model": 1024,
        "decoder_attention_heads": 16,
        "decoder_ffn_dim": 4096,
        "decoder_layerdrop": 0.0,
        "decoder_layers": 12,
        "decoder_start_token_id": 1,
        "diversity_penalty": 0.0,
        "do_sample": false,
        "dropout": 0.1,
        "early_stopping": true,
        "encoder_attention_heads": 16,
        "encoder_bos_token_id": 0,
        "encoder_eos_token_id": 2,
        "encoder_ffn_dim": 4096,
        "encoder_layerdrop": 0.0,
        "encoder_layers": 12,
        "encoder_no_repeat_ngram_size": 0,
        "encoder_pad_token_id": 1,
        "encoder_vocab_size": 51289,
        "eos_token_id": 1,
        "exponential_decay_length_penalty": null,
        "finetuning_task": null,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "gemma_config": {
            "_attn_implementation_autoset": false,
            "_attn_implementation": "eager",
            "_name_or_path": "",
            "add_cross_attention": false,
            "architectures": [
                "Gemma2ForCausalLM"
            ],
            "attention_bias": false,
            "attention_dropout": 0.0,
            "attn_logit_softcapping": 50.0,
            "bad_words_ids": null,
            "begin_suppress_tokens": null,
            "bos_token_id": 2,
            "cache_implementation": "hybrid",
            "chunk_size_feed_forward": 0,
            "cross_attention_hidden_size": null,
            "decoder_start_token_id": 1,
            "diversity_penalty": 0.0,
            "do_sample": false,
            "early_stopping": false,
            "encoder_hidden_size": 1024,
            "encoder_no_repeat_ngram_size": 0,
            "eos_token_id": 1,
            "exponential_decay_length_penalty": null,
            "final_logit_softcapping": 30.0,
            "finetuning_task": null,
            "forced_bos_token_id": null,
            "forced_eos_token_id": null,
            "head_dim": 256,
            "hidden_act": "gelu_pytorch_tanh",
            "hidden_activation": "gelu_pytorch_tanh",
            "hidden_size": 2304,
            "id2label": {
                "0": "LABEL_0",
                "1": "LABEL_1"
            },
            "initializer_range": 0.02,
            "intermediate_size": 9216,
            "is_decoder": false,
            "is_encoder_decoder": false,
            "label2id": {
                "LABEL_0": 0,
                "LABEL_1": 1
            },
            "length_penalty": 1.0,
            "max_length": 20,
            "max_position_embeddings": 8192,
            "min_length": 0,
            "model_type": "gemma2",
            "no_repeat_ngram_size": 0,
            "num_attention_heads": 8,
            "num_beam_groups": 1,
            "num_beams": 1,
            "num_hidden_layers": 26,
            "num_key_value_heads": 4,
            "num_return_sequences": 1,
            "output_attentions": false,
            "output_hidden_states": false,
            "output_scores": false,
            "pad_token_id": 0,
            "prefix": null,
            "problem_type": null,
            "pruned_heads": {},
            "query_pre_attn_scalar": 256,
            "remove_invalid_values": false,
            "repetition_penalty": 1.0,
            "return_dict": true,
            "return_dict_in_generate": false,
            "rms_norm_eps": 1e-06,
            "rope_theta": 10000.0,
            "sep_token_id": null,
            "sliding_window": 4096,
            "suppress_tokens": null,
            "task_specific_params": null,
            "temperature": 1.0,
            "tf_legacy_loss": false,
            "tie_encoder_decoder": false,
            "tie_word_embeddings": true,
            "tokenizer_class": null,
            "top_k": 50,
            "top_p": 1.0,
            "torch_dtype": "float32",
            "torchscript": false,
            "typical_p": 1.0,
            "use_bfloat16": false,
            "use_cache": true,
            "vocab_size": 256000
        },
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1",
            "2": "LABEL_2"
        },
        "init_std": 0.02,
        "is_decoder": false,
        "is_encoder_decoder": true,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1,
            "LABEL_2": 2
        },
        "length_penalty": 1.0,
        "max_length": 20,
        "max_position_embeddings": 4096,
        "min_length": 0,
        "model_type": "florence2_language",
        "no_repeat_ngram_size": 3,
        "normalize_before": false,
        "num_beam_groups": 1,
        "num_beams": 3,
        "num_hidden_layers": 12,
        "num_return_sequences": 1,
        "output_attentions": false,
        "output_hidden_states": false,
        "output_scores": false,
        "pad_token_id": 0,
        "prefix": null,
        "problem_type": null,
        "pruned_heads": {},
        "remove_invalid_values": false,
        "repetition_penalty": 1.0,
        "return_dict": true,
        "return_dict_in_generate": false,
        "scale_embedding": false,
        "sep_token_id": null,
        "suppress_tokens": null,
        "task_specific_params": null,
        "temperature": 1.0,
        "tf_legacy_loss": false,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": true,
        "tokenizer_class": null,
        "top_k": 50,
        "top_p": 1.0,
        "torch_dtype": null,
        "torchscript": false,
        "typical_p": 1.0,
        "use_bfloat16": false,
        "use_cache": true,
        "use_encoder_tokenizer": false,
        "vocab_size": 256000
    },
    "torch_dtype": "float16",
    "transformers_version": "4.48.0",
    "vision_config": {
        "_attn_implementation_autoset": false,
        "_attn_implementation": "eager",
        "model_type": "davit",
        "drop_path_rate": 0.1,
        "patch_size": [
            7,
            3,
            3,
            3
        ],
        "patch_stride": [
            4,
            2,
            2,
            2
        ],
        "patch_padding": [
            3,
            1,
            1,
            1
        ],
        "patch_prenorm": [
            false,
            true,
            true,
            true
        ],
        "enable_checkpoint": false,
        "dim_embed": [
            256,
            512,
            1024,
            2048
        ],
        "num_heads": [
            8,
            16,
            32,
            64
        ],
        "num_groups": [
            8,
            16,
            32,
            64
        ],
        "depths": [
            1,
            1,
            9,
            1
        ],
        "window_size": 12,
        "projection_dim": 1024,
        "visual_temporal_embedding": {
            "type": "COSINE",
            "max_temporal_embeddings": 100
        },
        "image_pos_embed": {
            "type": "learned_abs_2d",
            "max_pos_embeddings": 50
        },
        "image_feature_source": [
            "spatial_avg_pool",
            "temporal_avg_pool"
        ]
    },
    "vocab_size": 256000
}