{
    "_name_or_path": "florence2",
    "architectures": [
        "Florence2ForConditionalGeneration"
    ],
    "auto_map": {
        "AutoConfig": "configuration_florence2.Florence2Config",
        "AutoModelForCausalLM": "modeling_florence2.Florence2ForConditionalGeneration"
    },
    "bos_token_id": 2,
    "decoder_start_token_id": 1,
    "encoder_vocab_size": 51289,
    "eos_token_id": 1,
    "forced_bos_token_id": 2,
    "forced_eos_token_id": 1,
    "ignore_index": -100,
    "model_type": "florence2",
    "pad_token_id": 0,
    "tie_word_embeddings": true,
    "is_encoder_decoder": true,
    "projection_dim": 1024,
    "text_config": {
        "_attn_implementation_autoset": false,
        "_attn_implementation": "eager",
        "_name_or_path": "",
        "use_encoder_tokenizer": true,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": true,
        "encoder_bos_token_id": 0,
        "encoder_eos_token_id": 2,
        "encoder_pad_token_id": 1,
        "encoder_vocab_size": 51289,
        "vocab_size": 256000,
        "activation_dropout": 0.1,
        "activation_function": "gelu",
        "add_bias_logits": false,
        "add_final_layer_norm": false,
        "attention_dropout": 0.1,
        "bos_token_id": 2,
        "classif_dropout": 0.1,
        "classifier_dropout": 0.0,
        "d_model": 1024,
        "decoder_attention_heads": 16,
        "decoder_ffn_dim": 4096,
        "decoder_layerdrop": 0.0,
        "decoder_layers": 12,
        "decoder_start_token_id": 1,
        "dropout": 0.1,
        "early_stopping": true,
        "encoder_attention_heads": 16,
        "encoder_ffn_dim": 4096,
        "encoder_layerdrop": 0.0,
        "encoder_layers": 12,
        "eos_token_id": 1,
        "forced_eos_token_id": 1,
        "forced_bos_token_id": 2,
        "gradient_checkpointing": false,
        "init_std": 0.02,
        "is_encoder_decoder": true,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1,
            "LABEL_2": 2
        },
        "max_position_embeddings": 4096,
        "no_repeat_ngram_size": 3,
        "normalize_before": false,
        "num_hidden_layers": 12,
        "pad_token_id": 0,
        "scale_embedding": false,
        "num_beams": 3,
        "gemma_config": {
            "_attn_implementation_autoset": false,
            "_attn_implementation": "eager",
            "_name_or_path": "",
            "add_cross_attention": false,
            "architectures": [
                "Gemma2ForCausalLM"
            ],
            "attention_bias": false,
            "attention_dropout": 0.0,
            "attn_logit_softcapping": 50.0,
            "bos_token_id": 2,
            "cache_implementation": "hybrid",
            "eos_token_id": 1,
            "final_logit_softcapping": 30.0,
            "head_dim": 256,
            "hidden_act": "gelu_pytorch_tanh",
            "hidden_activation": "gelu_pytorch_tanh",
            "hidden_size": 3584,
            "initializer_range": 0.02,
            "intermediate_size": 14336,
            "max_position_embeddings": 8192,
            "model_type": "gemma2",
            "num_attention_heads": 16,
            "num_hidden_layers": 42,
            "num_key_value_heads": 8,
            "pad_token_id": 0,
            "query_pre_attn_scalar": 256,
            "rms_norm_eps": 1e-06,
            "rope_theta": 10000.0,
            "sliding_window": 4096,
            "torch_dtype": "float32",
            "transformers_version": "4.42.0.dev0",
            "use_cache": true,
            "vocab_size": 256000,
            "decoder_start_token_id": 1,
            "tie_word_embeddings": true
        }
    },
    "vision_config": {
        "_attn_implementation_autoset": false,
        "_attn_implementation": "eager",
        "model_type": "davit",
        "drop_path_rate": 0.1,
        "patch_size": [
            7,
            3,
            3,
            3
        ],
        "patch_stride": [
            4,
            2,
            2,
            2
        ],
        "patch_padding": [
            3,
            1,
            1,
            1
        ],
        "patch_prenorm": [
            false,
            true,
            true,
            true
        ],
        "enable_checkpoint": false,
        "dim_embed": [
            256,
            512,
            1024,
            2048
        ],
        "num_heads": [
            8,
            16,
            32,
            64
        ],
        "num_groups": [
            8,
            16,
            32,
            64
        ],
        "depths": [
            1,
            1,
            9,
            1
        ],
        "window_size": 12,
        "projection_dim": 1024,
        "visual_temporal_embedding": {
            "type": "COSINE",
            "max_temporal_embeddings": 100
        },
        "image_pos_embed": {
            "type": "learned_abs_2d",
            "max_pos_embeddings": 50
        },
        "image_feature_source": [
            "spatial_avg_pool",
            "temporal_avg_pool"
        ]
    },
    "vocab_size": 256000,
    "torch_dtype": "float16"
}